/*==============================================================================
	
	CarManager.cpp - 交通システムー車管理
														Author : Yutaka Suganuma
														Date   : 2017/12/28
==============================================================================*/

/*------------------------------------------------------------------------------
	インクルードファイル
------------------------------------------------------------------------------*/
#include "CarManager.h"
#include "Car.h"
#include "GameObject.h"

/*------------------------------------------------------------------------------
	コンストラクタ
------------------------------------------------------------------------------*/
CarManager::CarManager( GameObject* parent)
{
	m_GameObject = new GameObject( parent);
}

/*------------------------------------------------------------------------------
	デストラクタ
------------------------------------------------------------------------------*/
CarManager::~CarManager()
{
	for (auto land : m_Cars)
	{
		if(land)
		{
			delete land;
		}
	}
	m_Cars.clear();
	m_Cars.shrink_to_fit();
}

/*------------------------------------------------------------------------------
	車のクリア
------------------------------------------------------------------------------*/
void CarManager::Clear(void)
{
	for (auto car : m_Cars)
	{
		car->Delete();
	}
	m_Cars.clear();
	m_Cars.shrink_to_fit();

}

/*------------------------------------------------------------------------------
	GameObjectの消去
------------------------------------------------------------------------------*/
void CarManager::DeleteGameObject(void)
{
	if (m_GameObject)
	{
		m_GameObject->ReleaseReserve();
		m_GameObject = NULL;
	}
}

/*------------------------------------------------------------------------------
	車を生成
------------------------------------------------------------------------------*/
Car* CarManager::CreateCar( void)
{
	auto car = new Car( this, m_GameObject);

	return car;
}

/*------------------------------------------------------------------------------
	車を取得
------------------------------------------------------------------------------*/
Car* CarManager::GetCar(int id)
{
	if (m_Cars.size() <= id)
	{
		return NULL;
	}

	return m_Cars[ id];
}

/*------------------------------------------------------------------------------
	車のIDを取得
------------------------------------------------------------------------------*/
int CarManager::GetCarID( Car* land)
{
	int size = m_Cars.size();
	for (int i = 0; i < size; i++)
	{
		if (m_Cars[i] == land)
		{
			return i;
		}
	}

	//発見できない
	return -1;
}

/*------------------------------------------------------------------------------
	登録を解除
------------------------------------------------------------------------------*/
bool CarManager::UnregisterCar( Car* land)
{
	int size = m_Cars.size();
	for (int i = 0; i < size; i++)
	{
		if (m_Cars[i] == land)
		{
			m_Cars[i] = NULL;
			return true;
		}
	}

	return false;
}

/*------------------------------------------------------------------------------
	車の数を取得
------------------------------------------------------------------------------*/
int CarManager::GetCarCount(void)
{
	int size = m_Cars.size();
	int count = 0;
	for (int i = 0; i < size; i++)
	{
		if (m_Cars[i])
		{
			count++;
		}
	}

	return count;
}
