/*==============================================================================

    Component.cpp - コンポーネント（基底クラス）
                                                       Author : Yutaka Suganuma
                                                       Date   : 2017/4/27
==============================================================================*/

/*------------------------------------------------------------------------------
	インクルードファイル
------------------------------------------------------------------------------*/
#include "Component.h"
#include "GameObject.h"

/*------------------------------------------------------------------------------
	静的メンバ変数宣言
------------------------------------------------------------------------------*/
std::list<Component*> Component::m_listReleaseComponent;

/*------------------------------------------------------------------------------
	コンストラクタ
------------------------------------------------------------------------------*/
Component::Component()
{
	m_pGameObject = NULL;
	m_pTransform = NULL;
	m_nLayer = eLayerDefault;
	m_bEnable = true;
	m_bRelease = false;
}

/*------------------------------------------------------------------------------
	コンストラクタ
	引数
	CScene *pScene
------------------------------------------------------------------------------*/
Component::Component( GameObject *pGameObject)
{
	m_pGameObject = pGameObject;
	m_nLayer = eLayerDefault;
	m_pTransform = m_pGameObject->GetComponent<Transform>();
	m_bEnable = true;
	m_bRelease = false;
}

/*------------------------------------------------------------------------------
	デストラクタ
------------------------------------------------------------------------------*/
Component::~Component()
{

}

/*------------------------------------------------------------------------------
	消去予約
------------------------------------------------------------------------------*/
void Component::ReleaseReserve(void)
{
	if (m_bRelease == true)
	{
		return;
	}

	m_bRelease = true;
	m_bEnable = false;

	m_listReleaseComponent.push_back(this);

}

/*------------------------------------------------------------------------------
	リストの順にコンポーネント消去
------------------------------------------------------------------------------*/
void Component::ReleaseList(void)
{
	for (Component* pComp : m_listReleaseComponent)
	{
		pComp->m_pGameObject->ReleaseComponent(pComp);
	}

	//リストをリセット
	m_listReleaseComponent.clear();
}



