/*==============================================================================

    Input.cpp - 入力
                                                       Author : Yutaka Suganuma
                                                       Date   : 2017/5/6
==============================================================================*/

/*------------------------------------------------------------------------------
	インクルードファイル
------------------------------------------------------------------------------*/
#include "Input.h"

/*------------------------------------------------------------------------------
	静的メンバ変数宣言
------------------------------------------------------------------------------*/
LPDIRECTINPUT8 Input::m_pInput = NULL;		//DirectInputオブジェクト

/*------------------------------------------------------------------------------
	コンストラクタ
------------------------------------------------------------------------------*/
Input::Input()
{
	m_pInputDevice = NULL;
}

/*------------------------------------------------------------------------------
	デストラクタ
------------------------------------------------------------------------------*/
Input::~Input()
{
	//デバイスオブジェクトの開放
	if( m_pInputDevice != NULL)
	{
		m_pInputDevice->Unacquire();
		m_pInputDevice->Release();
		m_pInputDevice = NULL;
	}

	//DirectInputオブジェクトの開放
	if( m_pInput != NULL)
	{
		m_pInput->Release();
		m_pInput = NULL;
	}
}

/*------------------------------------------------------------------------------
	初期化
	引数
		HINSTANCE hInst
		HWND hWnd
------------------------------------------------------------------------------*/
void Input::Init( HINSTANCE hInst, HWND hWnd)
{
	//DirectInputオブジェクトの作成
	if( m_pInput == NULL)
	{
		DirectInput8Create(hInst, DIRECTINPUT_VERSION, IID_IDirectInput8, (void**)&m_pInput, NULL);
	}
}



