/*==============================================================================

    Land.h - 建物の自動生成ー土地
                                                       Author : Yutaka Suganuma
                                                       Date   : 2017/12/7
==============================================================================*/

/*------------------------------------------------------------------------------
	インクルードファイル
------------------------------------------------------------------------------*/
#include "Land.h"
#include "GameObject.h"
#include "ComponentInclude.h"

/*------------------------------------------------------------------------------
	コンストラクタ
------------------------------------------------------------------------------*/
Land::Land( GameObject* buildingObject)
{
	m_Vertices.clear();

	m_Renderer = buildingObject->AddComponent<MeshPolygonRenderer>();
}


/*------------------------------------------------------------------------------
	初期化処理
------------------------------------------------------------------------------*/
void Land::Init( const std::vector<Vector3>& vertices)
{
	m_Vertices.clear();
	m_Vertices = vertices;
	m_Renderer->SetVertices( vertices);
}
