/*==============================================================================

    LandParameter.h - 町の自動生成ー土地の生成に用いるパラメーター
                                                       Author : Yutaka Suganuma
                                                       Date   : 2018/2/9
==============================================================================*/
#ifndef _LAND_PARAMETER_H_
#define _LAND_PARAMETER_H_

/*------------------------------------------------------------------------------
	インクルードファイル
------------------------------------------------------------------------------*/
#include "Manager.h"

/*------------------------------------------------------------------------------
	クラス定義
------------------------------------------------------------------------------*/
class LandParameter
{
public:
	std::vector<Vector3> m_Vertices;
	std::list<int> m_RoadIDs;

	std::string Save( void);
	void Load( Text& text);
};


#endif

