/*==============================================================================

    Renderer.cpp - レンダラー（基底クラス）
                                                       Author : Yutaka Suganuma
                                                       Date   : 2017/5/5
==============================================================================*/

/*------------------------------------------------------------------------------
	インクルードファイル
------------------------------------------------------------------------------*/
#include "Renderer.h"
#include "RenderManager.h"

/*------------------------------------------------------------------------------
	コンストラクタ
------------------------------------------------------------------------------*/
Renderer::Renderer()
{
	//マネージャーに登録
	Manager::GetRenderManager()->AddRenderer( this);
}

/*------------------------------------------------------------------------------
	アクティブ設定
------------------------------------------------------------------------------*/
void Renderer::SetActive(bool bEnable)
{
	if (m_bEnable == true && bEnable == false)
	{
		//マネージャーから削除
		Manager::GetRenderManager()->ReleaseRenderer( this);
	}
	else if (m_bEnable == false && bEnable == true)
	{
		//マネージャーに登録
		Manager::GetRenderManager()->AddRenderer( this);
	}

	m_bEnable = bEnable;
}
