/*==============================================================================

    SoundManager.h - サウンド管理
                                                       Author : Yutaka Suganuma
                                                       Date   : 2017/7/17
==============================================================================*/
#ifndef _SOUND_MANAGER_H_
#define _SOUND_MANAGER_H_

/*------------------------------------------------------------------------------
	インクルードファイル
------------------------------------------------------------------------------*/
#include "Manager.h"

/*------------------------------------------------------------------------------
	前方宣言
------------------------------------------------------------------------------*/
class SoundData;

/*------------------------------------------------------------------------------
	クラス定義
------------------------------------------------------------------------------*/
class SoundManager
{
public:
	SoundManager( HWND hWnd);
	~SoundManager();

	SoundData* SetSound( std::string FileName, int nCntLoop);

private:
	std::unordered_map< std::string, SoundData *> m_mapData;		//サウンドデータマップ
	IXAudio2 *m_pXAudio2;											//XAudio2オブジェクトへのインターフェイス
	IXAudio2MasteringVoice *m_pMasteringVoice;						//マスターボイス
};

#endif