/*==============================================================================

    Texture.cpp - テクスチャ
                                                       Author : Yutaka Suganuma
                                                       Date   : 2017/4/1
==============================================================================*/

/*------------------------------------------------------------------------------
	インクルードファイル
------------------------------------------------------------------------------*/
#include "Texture.h"

/*------------------------------------------------------------------------------
	コンストラクタ
	引数
		const char* pFileName
------------------------------------------------------------------------------*/
Texture::Texture( std::string FileName)
{
	if( FAILED( D3DXCreateTextureFromFile( Manager::GetDevice(), FileName.c_str(), &m_pTexture)))
	{
		//エラー
		MessageBox( NULL, "テクスチャを読み込めません\n", "エラー", MB_OK);
		return;
	}
}

/*------------------------------------------------------------------------------
	デストラクタ
------------------------------------------------------------------------------*/
Texture::~Texture()
{
	if( m_pTexture != NULL){		//テクスチャインターフェイスが存在するとき
		m_pTexture->Release();		//テクスチャインターフェイスの解放
		m_pTexture = NULL;
	}
}

/*------------------------------------------------------------------------------
	テクスチャの設定
------------------------------------------------------------------------------*/
void Texture::Set( void)
{
	Manager::GetDevice()->SetTexture( 0, m_pTexture);
}