/*==============================================================================

    TextureManager.h - テクスチャ管理
                                                       Author : Yutaka Suganuma
                                                       Date   : 2017/3/31
==============================================================================*/
#ifndef _TEXTURE_MANAGER_H_
#define _TEXTURE_MANAGER_H_

/*------------------------------------------------------------------------------
	インクルードファイル
------------------------------------------------------------------------------*/
#include "Manager.h"

/*------------------------------------------------------------------------------
	前方宣言
------------------------------------------------------------------------------*/
class Texture;
class RenderTexture;

/*------------------------------------------------------------------------------
	マクロ定義
------------------------------------------------------------------------------*/
#define DEFAULT_TEXTURE_FILE_NAME "data/TEXTURE/default.jpg"		//デフォルトのテクスチャのファイル名

/*------------------------------------------------------------------------------
	クラス定義
------------------------------------------------------------------------------*/
class TextureManager
{
public:
	TextureManager();
	~TextureManager();

	Texture *Load( std::string FileName);
	RenderTexture *CreateRenderTexture( std::string TextureName, bool isBuckBuffer);

private:
	std::unordered_map< std::string, Texture*> m_mapTexture;		//テクスチャマップ
	Texture* m_DefaultTexture;
};



#endif