/*==============================================================================

    Tile.cpp - 建物の自動生成ータイル
                                                       Author : Yutaka Suganuma
                                                       Date   : 2017/12/7
==============================================================================*/

/*------------------------------------------------------------------------------
	インクルードファイル
------------------------------------------------------------------------------*/
#include "Tile.h"

/*------------------------------------------------------------------------------
	コンストラクタ
------------------------------------------------------------------------------*/
Tile::Tile() : m_Next( NULL)
{
	m_Height = 1.0f;
	m_Width = 1.0f;
}


/*------------------------------------------------------------------------------
	初期化
------------------------------------------------------------------------------*/
void Tile::Init( float height, float width)
{
	m_Height = height;
	m_Width = width;

	//TODO:タイルの設定

}

/*------------------------------------------------------------------------------
	頂点バッファの設定
------------------------------------------------------------------------------*/
Vector3 Tile::SetVertexBuffer(VERTEX_3D* pVtx, const Vector3& bottomLeftPosition, const Vector3& normal, const Vector3& vector)
{
	//TODO:頂点バッファの設定
	Vector3 nextPosition = bottomLeftPosition + vector * m_Width;

	return nextPosition;
}

/*------------------------------------------------------------------------------
	頂点バッファの設定（円に沿って曲げる）
------------------------------------------------------------------------------*/
Vector3 Tile::SetVertexBufferCurve(VERTEX_3D* pVtx, const Vector3& bottomLeftPosition,  const Vector3& center, float radius)
{
	//TODO:頂点バッファの設定
	float angle = CulcAngle( radius);
	Vector3 nextPosition = bottomLeftPosition;

	return nextPosition;
}

/*------------------------------------------------------------------------------
	頂点数の算出
------------------------------------------------------------------------------*/
int Tile::CulcCountVertex()
{
	return 4 + 2;
}

/*------------------------------------------------------------------------------
	頂点数の算出（円に沿って曲げる場合）
------------------------------------------------------------------------------*/
int Tile::CulcCountVertexCurve( float radius)
{
	int countDivide = CulcCountDivide( radius);
	int countVertex = ( countDivide + 2) * 2 + 2;

	return countVertex;
}

/*------------------------------------------------------------------------------
	ポリゴン数の算出
------------------------------------------------------------------------------*/
int Tile::CulcCountPolygon()
{
	return 6;
}

/*------------------------------------------------------------------------------
	ポリゴン数の算出（円に沿って曲げる場合）
------------------------------------------------------------------------------*/
int Tile::CulcCountPolygonCurve( float radius)
{
	int countDivide = CulcCountDivide( radius);


	return 6 + countDivide * 2;
}

/*------------------------------------------------------------------------------
	分割数を算出
------------------------------------------------------------------------------*/
int Tile::CulcCountDivide(float radius)
{
	float angle = CulcAngle( radius);
	return (int)( angle / TILE_DIVIDE_PER_RADIAN);
}

