/*==============================================================================

    TileSplit.cpp - 建物の自動生成ータイル（割れ目）
                                                       Author : Yutaka Suganuma
                                                       Date   : 2018/1/11
==============================================================================*/

/*------------------------------------------------------------------------------
	インクルードファイル
------------------------------------------------------------------------------*/
#include "TileSplit.h"

/*------------------------------------------------------------------------------
	初期化
------------------------------------------------------------------------------*/
void TileSplit::Init( TileSplit* other, const Vector3& bottomLeftPosition)
{
	m_OtherSplit = other;
	m_Next = NULL;
	m_Height = 0.0f;
	m_Width = 0.0f;
	m_BottomLeftPosition = bottomLeftPosition;
	m_Type = eTileSplit;
}
